# Understanding the data

* Getting raw data

In [2]:
%pip install pandas

Requirement already satisfied: pandas in d:\study\ds\.venv\lib\site-packages (2.3.0)
Requirement already satisfied: numpy>=1.26.0 in d:\study\ds\.venv\lib\site-packages (from pandas) (2.3.0)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\study\ds\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\study\ds\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in d:\study\ds\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in d:\study\ds\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
import pandas as pd

In [5]:
df = pd.read_csv("data/Titanic-Dataset.csv")

# Questions to ask before starting

<h3>1. How big is the data?</h3>

In [6]:
df.shape

(891, 12)

So there are 891 rows and 12 columns

In [7]:
# df.head()  -- might make bias toughts in our mind

df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
321,322,0,3,"Danoff, Mr. Yoto",male,27.0,0,0,349219,7.8958,NaN,S
487,488,0,1,"Kent, Mr. Edward Austin",male,58.0,0,0,11771,29.7000,B37,C
228,229,0,2,"Fahlstrom, Mr. Arne Jonas",male,18.0,0,0,236171,13.0000,NaN,S
528,529,0,3,"Salonen, Mr. Johan Werner",male,39.0,0,0,3101296,7.9250,NaN,S
323,324,1,2,"Caldwell, Mrs. Albert Francis (Sylvia Mae Harb...",female,22.0,1,1,248738,29.0000,NaN,S

<h3>3. What are the DataTypes ?</h3>

In [ ]:
df.info()

<h3>4. Are there any missing values? </h3>

In [ ]:
df.isnull().sum()

<h3>5. How does the data look like Mathematically ?</h3>

In [ ]:
df.describe()

<h3>6. Are there any duplicate values ?</h3>

In [ ]:
df.duplicated().sum()

<h3>7. How is the correlation between columns ?</h3>

In [ ]:
# df.select_dtypes(include='number').corr()
df.select_dtypes(include='number').corr()['Survived']